[
  {
    "word": "Cacophony",
    "meaning": "a harsh, discordant mixture of sounds",
    "example": "The cacophony of car horns and sirens filled the busy street.",
    "antonym": "harmony"
  },
  {
    "word": "Cajole",
    "meaning": "to persuade someone to do something by sustained coaxing or flattery",
    "example": "She tried to cajole her friend into going to the party.",
    "antonym": "coerce"
  },
  {
    "word": "Capricious",
    "meaning": "given to sudden and unaccountable changes of mood or behavior",
    "example": "The capricious weather changed from sunny to stormy in minutes.",
    "antonym": "consistent"
  },
  {
    "word": "Castigate",
    "meaning": "to reprimand someone severely",
    "example": "The critic castigated the author for the poorly written novel.",
    "antonym": "praise"
  },
  {
    "word": "Catalyst",
    "meaning": "a substance that speeds up a chemical reaction; a person or thing that precipitates an event",
    "example": "The new technology served as a catalyst for industry-wide changes.",
    "antonym": "inhibitor"
  },
  {
    "word": "Caustic",
    "meaning": "able to burn or corrode organic tissue; sarcastic in a scathing and bitter way",
    "example": "Her caustic comments about his work deeply offended him.",
    "antonym": "gentle"
  },
  {
    "word": "Chicanery",
    "meaning": "the use of trickery to achieve a political, financial, or legal purpose",
    "example": "The politician's chicanery was exposed by investigative journalists.",
    "antonym": "honesty"
  },
  {
    "word": "Churlish",
    "meaning": "rude in a mean -spirited and surly way",
    "example": "His churlish behavior at the dinner party embarrassed everyone.",
    "antonym": "courteous"
  },
  {
    "word": "Circumscribe",
    "meaning": "to restrict within limits",
    "example": "The new regulations will circumscribe the company's operations.",
    "antonym": "expand"
  },
  {
    "word": "Circumspect",
    "meaning": "wary and unwilling to take risks",
    "example": "She was circumspect about sharing personal information online.",
    "antonym": "reckless"
  },
  {
    "word": "Clandestine",
    "meaning": "kept secret or done secretively",
    "example": "The spies met in a clandestine location to exchange information.",
    "antonym": "open"
  },
  {
    "word": "Cogent",
    "meaning": "clear, logical, and convincing",
    "example": "His cogent argument convinced the jury of the defendant's innocence.",
    "antonym": "illogical"
  },
  {
    "word": "Commensurate",
    "meaning": "corresponding in size or degree; in proportion",
    "example": "Her salary increase was commensurate with her increased responsibilities.",
    "antonym": "disproportionate"
  },
  {
    "word": "Commiserate",
    "meaning": "to express or feel sympathy or pity",
    "example": "Friends gathered to commiserate with her after the loss.",
    "antonym": "celebrate"
  },
  {
    "word": "Compendium",
    "meaning": "a concise but detailed collection of information",
    "example": "The medical compendium contained information about rare diseases.",
    "antonym": "excerpt"
  },
  {
    "word": "Complacent",
    "meaning": "showing smug or uncritical satisfaction with oneself",
    "example": "The team became complacent after winning the championship.",
    "antonym": "ambitious"
  },
  {
    "word": "Concede",
    "meaning": "to admit that something is true or valid after first denying or resisting it",
    "example": "After hours of debate, he finally conceded that he was wrong.",
    "antonym": "deny"
  },
  {
    "word": "Conciliate",
    "meaning": "to stop someone from being angry or discontented",
    "example": "The mediator worked to conciliate the two warring factions.",
    "antonym": "antagonize"
  },
  {
    "word": "Condone",
    "meaning": "to accept or allow behavior that is morally wrong or offensive",
    "example": "The school cannot condone cheating on exams.",
    "antonym": "condemn"
  },
  {
    "word": "Confound",
    "meaning": "to cause surprise or confusion",
    "example": "The unexpected results confound our previous theories.",
    "antonym": "clarify"
  },
  {
    "word": "Connoisseur",
    "meaning": "an expert judge in matters of taste",
    "example": "The wine connoisseur could identify the vintage by taste alone.",
    "antonym": "amateur"
  },
  {
    "word": "Convoluted",
    "meaning": "extremely complex and difficult to follow",
    "example": "The convoluted plot of the mystery novel confused many readers.",
    "antonym": "simple"
  },
  {
    "word": "Corroborate",
    "meaning": "to confirm or give support to a statement, theory, or finding",
    "example": "The witness testimony corroborated the defendant's alibi.",
    "antonym": "contradict"
  },
  {
    "word": "Credulous",
    "meaning": "having or showing too great a readiness to believe things",
    "example": "The credulous child believed every word of the fairy tale.",
    "antonym": "skeptical"
  },
  {
    "word": "Culpable",
    "meaning": "deserving blame",
    "example": "The driver was found culpable for the accident due to reckless driving.",
    "antonym": "innocent"
  },
  {
    "word": "Cursory",
    "meaning": "hasty and therefore not thorough or detailed",
    "example": "A cursory glance at the report revealed several obvious errors.",
    "antonym": "thorough"
  }
]
