[
  {
    "word": "Ebullient",
    "meaning": "cheerful and full of energy",
    "example": "Her ebullient personality made her popular at social gatherings.",
    "antonym": "lethargic"
  },
  {
    "word": "Eccentric",
    "meaning": "unconventional and slightly strange",
    "example": "The eccentric artist wore mismatched shoes and colorful hats.",
    "antonym": "conventional"
  },
  {
    "word": "Eclectic",
    "meaning": "deriving ideas or style from a broad and diverse range of sources",
    "example": "The museum's eclectic collection included art from many cultures.",
    "antonym": "uniform"
  },
  {
    "word": "Efficacy",
    "meaning": "the ability to produce a desired or intended result",
    "example": "The efficacy of the new drug was proven through clinical trials.",
    "antonym": "ineffectiveness"
  },
  {
    "word": "Effrontery",
    "meaning": "shameless boldness; audacity",
    "example": "She had the effrontery to ask for a raise after being late every day.",
    "antonym": "modesty"
  },
  {
    "word": "Egregious",
    "meaning": "outstandingly bad; shocking",
    "example": "The company's egregious safety violations led to severe penalties.",
    "antonym": "excellent"
  },
  {
    "word": "Elicit",
    "meaning": "to evoke or draw out a response or reaction",
    "example": "The interviewer tried to elicit honest responses from the candidate.",
    "antonym": "suppress"
  },
  {
    "word": "Eloquence",
    "meaning": "fluent or persuasive speaking or writing",
    "example": "His eloquence as a speaker made him a sought-after keynote presenter.",
    "antonym": "inarticulateness"
  },
  {
    "word": "Embellish",
    "meaning": "to make something more attractive by adding decorative details",
    "example": "The storyteller tended to embellish details to make tales more exciting.",
    "antonym": "simplify"
  },
  {
    "word": "Emollient",
    "meaning": "having the quality of softening or soothing the skin",
    "example": "The doctor recommended an emollient cream for her dry skin.",
    "antonym": "harsh"
  },
  {
    "word": "Empirical",
    "meaning": "based on observation or experience rather than theory",
    "example": "The scientist demanded empirical evidence to support the hypothesis.",
    "antonym": "theoretical"
  },
  {
    "word": "Enervate",
    "meaning": "to cause someone to feel drained of energy; weaken",
    "example": "The long, boring lecture began to enervate the tired students.",
    "antonym": "energize"
  },
  {
    "word": "Engender",
    "meaning": "to cause or give rise to (a feeling, situation, or condition)",
    "example": "Poor leadership can engender mistrust among team members.",
    "antonym": "prevent"
  },
  {
    "word": "Enigma",
    "meaning": "a person or thing that is mysterious or difficult to understand",
    "example": "The mysterious woman remained an enigma to everyone who met her.",
    "antonym": "clarity"
  },
  {
    "word": "Enumerate",
    "meaning": "to mention (a number of things) one by one",
    "example": "The report will enumerate all the problems found during the audit.",
    "antonym": "summarize"
  },
  {
    "word": "Ephemeral",
    "meaning": "lasting for a very short time",
    "example": "The beauty of cherry blossoms is ephemeral, lasting only a few weeks.",
    "antonym": "permanent"
  },
  {
    "word": "Equanimity",
    "meaning": "mental calmness, composure, and evenness of temper",
    "example": "She maintained her equanimity even during the heated argument.",
    "antonym": "agitation"
  },
  {
    "word": "Equivocate",
    "meaning": "to use ambiguous language to conceal the truth or avoid committing oneself",
    "example": "Politicians often equivocate when asked about controversial topics.",
    "antonym": "clarify"
  },
  {
    "word": "Erudite",
    "meaning": "having or showing great knowledge or learning",
    "example": "The professor's erudite commentary impressed the academic audience.",
    "antonym": "ignorant"
  },
  {
    "word": "Eschew",
    "meaning": "to deliberately avoid using; abstain from",
    "example": "Health-conscious people often eschew processed foods and sugar.",
    "antonym": "embrace"
  },
  {
    "word": "Esoteric",
    "meaning": "intended for or likely to be understood by only a small number of people",
    "example": "The philosopher's esoteric theories were difficult for laypeople to understand.",
    "antonym": "common"
  },
  {
    "word": "Eulogy",
    "meaning": "a speech or piece of writing that praises someone highly",
    "example": "The moving eulogy celebrated the deceased's life and achievements.",
    "antonym": "criticism"
  },
  {
    "word": "Euphemism",
    "meaning": "a mild or indirect word or expression substituted for one considered too harsh",
    "example": "'Passed away' is a euphemism for 'died' that sounds gentler.",
    "antonym": "directness"
  },
  {
    "word": "Exacerbate",
    "meaning": "to make a problem, situation, or negative feeling worse",
    "example": "The hot weather will exacerbate her allergies and asthma.",
    "antonym": "alleviate"
  },
  {
    "word": "Exacting",
    "meaning": "making great demands on one's skill, attention, or other resources",
    "example": "The exacting requirements of medical school challenge even the best students.",
    "antonym": "lenient"
  },
  {
    "word": "Exculpate",
    "meaning": "to show or declare that someone is not guilty of wrongdoing",
    "example": "New evidence emerged that will exculpate the wrongfully accused man.",
    "antonym": "incriminate"
  },
  {
    "word": "Execrable",
    "meaning": "extremely bad or unpleasant",
    "example": "The movie was so execrable that critics walked out mid-screening.",
    "antonym": "excellent"
  },
  {
    "word": "Exigent",
    "meaning": "pressing; demanding",
    "example": "The exigent circumstances required immediate emergency action.",
    "antonym": "relaxed"
  },
  {
    "word": "Exonerate",
    "meaning": "to absolve someone from blame for a fault or wrongdoing",
    "example": "The DNA test will exonerate the prisoner after twenty years.",
    "antonym": "blame"
  },
  {
    "word": "Expedite",
    "meaning": "to make (an action or process) happen sooner or be accomplished more quickly",
    "example": "The hospital will expedite test results for critical patients.",
    "antonym": "delay"
  },
  {
    "word": "Expiate",
    "meaning": "to atone for (guilt or sin)",
    "example": "He volunteered at the shelter to expiate his guilt over the accident.",
    "antonym": "offend"
  },
  {
    "word": "Extant",
    "meaning": "still in existence; surviving",
    "example": "Few extant manuscripts from the medieval period remain in good condition.",
    "antonym": "extinct"
  },
  {
    "word": "Extenuate",
    "meaning": "to make (guilt or an offense) seem less serious or more forgivable",
    "example": "His difficult childhood doesn't extenuate his criminal behavior.",
    "antonym": "aggravate"
  }
]
