[
  {
    "word": "Facetious",
    "meaning": "treating serious issues with deliberately inappropriate humor",
    "example": "His facetious comment about the tragedy was inappropriate and hurtful.",
    "antonym": "serious"
  },
  {
    "word": "Fallacious",
    "meaning": "based on a mistaken belief",
    "example": "The lawyer's fallacious argument was easily disproven by evidence.",
    "antonym": "accurate"
  },
  {
    "word": "Fatuous",
    "meaning": "silly and pointless",
    "example": "His fatuous suggestion to solve world hunger with magic was ignored.",
    "antonym": "sensible"
  },
  {
    "word": "Fawning",
    "meaning": "displaying exaggerated flattery or affection",
    "example": "The employee's fawning behavior toward the boss made colleagues uncomfortable.",
    "antonym": "aloof"
  },
  {
    "word": "Fecund",
    "meaning": "capable of producing an abundance of offspring or new growth; fertile",
    "example": "The fecund artist produced dozens of paintings each year.",
    "antonym": "barren"
  },
  {
    "word": "Ferocity",
    "meaning": "the state or quality of being ferocious; savagery",
    "example": "The ferocity of the storm surprised even the experienced sailors.",
    "antonym": "gentleness"
  },
  {
    "word": "Fervid",
    "meaning": "intensely enthusiastic or passionate",
    "example": "His fervid support for environmental causes inspired many volunteers.",
    "antonym": "apathetic"
  },
  {
    "word": "Flagrant",
    "meaning": "(of something considered wrong or immoral) conspicuously or obviously offensive",
    "example": "The company's flagrant violation of safety rules shocked inspectors.",
    "antonym": "subtle"
  },
  {
    "word": "Flippant",
    "meaning": "not showing a serious or respectful attitude",
    "example": "Her flippant response to the serious question angered the interviewer.",
    "antonym": "respectful"
  },
  {
    "word": "Florid",
    "meaning": "excessively intricate or elaborate; having a red or flushed complexion",
    "example": "The author's florid prose was beautiful but difficult to follow.",
    "antonym": "simple"
  },
  {
    "word": "Flout",
    "meaning": "to openly disregard (a rule, law, or convention)",
    "example": "Teenagers often flout curfew rules set by their parents.",
    "antonym": "obey"
  },
  {
    "word": "Foment",
    "meaning": "to instigate or stir up (an undesirable or violent sentiment or course of action)",
    "example": "The rebel leader tried to foment unrest among the citizens.",
    "antonym": "quell"
  },
  {
    "word": "Fractious",
    "meaning": "irritable and quarrelsome",
    "example": "The fractious child refused to cooperate with the babysitter.",
    "antonym": "cooperative"
  },
  {
    "word": "Fulminates",
    "meaning": "expresses vehement protest",
    "example": "The senator fulminates against the proposed tax increases.",
    "antonym": "praises"
  },
  {
    "word": "Furtive",
    "meaning": "attempting to avoid notice or attention, typically because of guilt or a belief that discovery would lead to trouble",
    "example": "His furtive glances toward the exit made everyone suspicious.",
    "antonym": "open"
  }
]
