[
  {
    "word": "Iconoclast",
    "meaning": "a person who attacks or criticizes cherished beliefs or institutions",
    "example": "The young iconoclast challenged traditional teaching methods.",
    "antonym": "traditionalist"
  },
  {
    "word": "Idiosyncrasy",
    "meaning": "a mode of behavior or way of thought peculiar to an individual",
    "example": "His idiosyncrasy of always wearing mismatched socks became his trademark.",
    "antonym": "conformity"
  },
  {
    "word": "Ignominious",
    "meaning": "deserving or causing public disgrace or shame",
    "example": "The politician's ignominious defeat ended his career in public service.",
    "antonym": "honorable"
  },
  {
    "word": "Illicit",
    "meaning": "forbidden by law, rules, or custom",
    "example": "Police discovered illicit drugs hidden in the abandoned warehouse.",
    "antonym": "legal"
  },
  {
    "word": "Imbroglio",
    "meaning": "an extremely confused, complicated, or embarrassing situation",
    "example": "The diplomatic imbroglio required careful negotiation to resolve.",
    "antonym": "clarity"
  },
  {
    "word": "Immutable",
    "meaning": "unchanging over time or unable to be changed",
    "example": "The laws of physics appear to be immutable constants of the universe.",
    "antonym": "changeable"
  },
  {
    "word": "Impecunious",
    "meaning": "having little or no money",
    "example": "The impecunious student worked three jobs to pay for college.",
    "antonym": "wealthy"
  },
  {
    "word": "Imperious",
    "meaning": "assuming power or authority without justification; arrogant and domineering",
    "example": "The imperious manager demanded immediate compliance from all employees.",
    "antonym": "humble"
  },
  {
    "word": "Imperturbable",
    "meaning": "unable to be upset or excited; calm",
    "example": "The crisis manager remained imperturbable despite the chaos around her.",
    "antonym": "agitated"
  },
  {
    "word": "Impetuous",
    "meaning": "acting or done quickly and without thought or care",
    "example": "His impetuous decision to quit without notice surprised everyone.",
    "antonym": "deliberate"
  },
  {
    "word": "Implacable",
    "meaning": "unable to be appeased or placated",
    "example": "The victim's family showed implacable opposition to the early parole.",
    "antonym": "placable"
  },
  {
    "word": "Impugn",
    "meaning": "to dispute the truth, validity, or honesty of a statement or motive; to call into question",
    "example": "The opposition tried to impugn the senator's reputation with false accusations.",
    "antonym": "support"
  },
  {
    "word": "Impugned",
    "meaning": "challenged or called into question",
    "example": "The witness's credibility was impugned by contradictory evidence.",
    "antonym": "supported"
  },
  {
    "word": "Inchoate",
    "meaning": "just begun and so not fully formed or developed; rudimentary",
    "example": "The artist's inchoate ideas gradually developed into a masterpiece.",
    "antonym": "mature"
  },
  {
    "word": "Incipient",
    "meaning": "in an initial stage; beginning to happen or develop",
    "example": "The doctor detected incipient signs of the disease before symptoms appeared.",
    "antonym": "advanced"
  },
  {
    "word": "Indefatigable",
    "meaning": "(of a person or their efforts) persisting tirelessly",
    "example": "The indefatigable researcher worked tirelessly for decades on the cure.",
    "antonym": "tired"
  },
  {
    "word": "Indolent",
    "meaning": "wanting to avoid activity or exertion; lazy",
    "example": "The indolent teenager spent the entire summer lounging by the pool.",
    "antonym": "industrious"
  },
  {
    "word": "Inevitability",
    "meaning": "the quality of being certain to happen",
    "example": "The inevitability of change is one of life's few constants.",
    "antonym": "avoidability"
  },
  {
    "word": "Ineluctable",
    "meaning": "unable to be resisted or avoided; inescapable",
    "example": "Death is the ineluctable fate that awaits all living beings.",
    "antonym": "avoidable"
  },
  {
    "word": "Inexorable",
    "meaning": "impossible to stop or prevent",
    "example": "The inexorable march of time cannot be stopped or reversed.",
    "antonym": "stoppable"
  },
  {
    "word": "Ingenuous",
    "meaning": "(of a person or action) innocent and unsuspecting",
    "example": "The child's ingenuous questions revealed her natural curiosity.",
    "antonym": "sophisticated"
  },
  {
    "word": "Inimical",
    "meaning": "tending to obstruct or harm; unfriendly",
    "example": "The harsh weather conditions were inimical to outdoor activities.",
    "antonym": "friendly"
  },
  {
    "word": "Innocuous",
    "meaning": "not harmful or offensive",
    "example": "What seemed like an innocuous comment actually offended several people.",
    "antonym": "harmful"
  },
  {
    "word": "Inscrutable",
    "meaning": "impossible to understand or interpret",
    "example": "The ancient philosopher's inscrutable writings puzzled scholars for centuries.",
    "antonym": "clear"
  },
  {
    "word": "Insipid",
    "meaning": "lacking flavor, vigor, or interest",
    "example": "The insipid conversation about the weather bored everyone at dinner.",
    "antonym": "interesting"
  },
  {
    "word": "Intractable",
    "meaning": "hard to control or deal with",
    "example": "The intractable problem required months of dedicated research to solve.",
    "antonym": "manageable"
  },
  {
    "word": "Intransigent",
    "meaning": "unwilling or refusing to change one's views or to agree about something",
    "example": "Both sides remained intransigent during the lengthy peace negotiations.",
    "antonym": "flexible"
  },
  {
    "word": "Intrepid",
    "meaning": "fearless; adventurous",
    "example": "The intrepid explorer ventured into uncharted territory alone.",
    "antonym": "timid"
  },
  {
    "word": "Inundate",
    "meaning": "to overwhelm someone with things or people to be dealt with",
    "example": "Reporters inundate celebrities with questions about their personal lives.",
    "antonym": "drain"
  },
  {
    "word": "Inure",
    "meaning": "to accustom (someone) to something, especially something unpleasant",
    "example": "Years of criticism helped inure her to negative feedback.",
    "antonym": "sensitize"
  },
  {
    "word": "Invidious",
    "meaning": "likely to arouse or incur resentment or anger in others",
    "example": "Making invidious comparisons between students creates unnecessary competition.",
    "antonym": "fair"
  },
  {
    "word": "Irascible",
    "meaning": "easily angered",
    "example": "The irascible old man yelled at children who walked on his lawn.",
    "antonym": "calm"
  },
  {
    "word": "Irresolute",
    "meaning": "showing or feeling hesitancy; uncertain",
    "example": "His irresolute leadership style frustrated team members who needed direction.",
    "antonym": "resolute"
  },
  {
    "word": "Itinerant",
    "meaning": "traveling from place to place",
    "example": "The itinerant musician traveled from town to town performing concerts.",
    "antonym": "settled"
  },
  {
    "word": "Incongruity",
    "meaning": "the state of being incongruous; incompatibility",
    "example": "There was an incongruity between his words and his actions.",
    "antonym": "congruity"
  }
]
