[
  {
    "word": "Magnanimous",
    "meaning": "very generous or forgiving, especially toward a rival or someone less powerful",
    "example": "The magnanimous winner graciously congratulated his defeated opponent.",
    "antonym": "petty"
  },
  {
    "word": "Malediction",
    "meaning": "a curse; a magical word or phrase uttered with the intention of bringing about evil or destruction",
    "example": "The witch's malediction was said to bring misfortune to the village.",
    "antonym": "blessing"
  },
  {
    "word": "Malevolent",
    "meaning": "having or showing a wish to do evil to others",
    "example": "The villain's malevolent plan threatened to destroy the entire kingdom.",
    "antonym": "benevolent"
  },
  {
    "word": "Malinger",
    "meaning": "to exaggerate or feign illness in order to escape duty or work",
    "example": "The soldier was caught trying to malinger to avoid dangerous duty.",
    "antonym": "persevere"
  },
  {
    "word": "Malleable",
    "meaning": "easily influenced; pliable",
    "example": "Clay becomes malleable when moistened, making it perfect for sculpting.",
    "antonym": "rigid"
  },
  {
    "word": "Martial",
    "meaning": "of or appropriate to war; warlike",
    "example": "The general's martial bearing commanded respect from all his subordinates.",
    "antonym": "peaceful"
  },
  {
    "word": "Martinet",
    "meaning": "a strict disciplinarian, especially in the armed forces",
    "example": "The drill sergeant was a martinet who demanded absolute perfection.",
    "antonym": "lenient"
  },
  {
    "word": "Maudlin",
    "meaning": "self-pityingly or tearfully sentimental",
    "example": "His maudlin speech about his lost love embarrassed the wedding guests.",
    "antonym": "cheerful"
  },
  {
    "word": "Maverick",
    "meaning": "an unorthodox or independent -minded person",
    "example": "The maverick scientist pursued unconventional research methods.",
    "antonym": "conformist"
  },
  {
    "word": "Mendacity",
    "meaning": "untruthfulness",
    "example": "The politician's mendacity was exposed when recordings surfaced.",
    "antonym": "honesty"
  },
  {
    "word": "Mercurial",
    "meaning": "subject to sudden or unpredictable changes of mood or mind",
    "example": "His mercurial temperament made him unpredictable in business dealings.",
    "antonym": "stable"
  },
  {
    "word": "Meticulous",
    "meaning": "showing great attention to detail; very careful and precise",
    "example": "The accountant's meticulous record-keeping prevented any financial errors.",
    "antonym": "careless"
  },
  {
    "word": "Misanthrope",
    "meaning": "a person who dislikes humankind and avoids human society",
    "example": "The old misanthrope lived alone and avoided all social contact.",
    "antonym": "philanthropist"
  },
  {
    "word": "Mitigate",
    "meaning": "to make less severe, serious, or painful",
    "example": "The company implemented safety measures to mitigate workplace accidents.",
    "antonym": "aggravate"
  },
  {
    "word": "Mollify",
    "meaning": "to appease the anger or anxiety of someone",
    "example": "The manager tried to mollify angry customers with free meal vouchers.",
    "antonym": "antagonize"
  },
  {
    "word": "Morose",
    "meaning": "sullen and ill -tempered",
    "example": "The actor's morose expression perfectly conveyed his character's despair.",
    "antonym": "cheerful"
  },
  {
    "word": "Munificent",
    "meaning": "more generous than is usual or necessary",
    "example": "The munificent donor's gift allowed the museum to expand significantly.",
    "antonym": "stingy"
  }
]
